In [1]:
import pandas as pd
import numpy as np

In [2]:
books= pd.read_csv("books.csv",error_bad_lines=False,encoding='latin-1')

c:\python39\lib\site-packages\IPython\core\interactiveshell.py:3441: FutureWarning: The error_bad_lines argument has been deprecated and will be removed in a future version.


  exec(code_obj, self.user_global_ns, self.user_ns)
c:\python39\lib\site-packages\IPython\core\interactiveshell.py:3441: DtypeWarning: Columns (3) have mixed types.Specify dtype option on import or set low_memory=False.
  exec(code_obj, self.user_global_ns, self.user_ns)

In [3]:
books.columns

Index(['ISBN', 'Book-Title', 'Book-Author', 'Year-Of-Publication', 'Publisher',
       'Image-URL-S', 'Image-URL-M', 'Image-URL-L'],
      dtype='object')

In [4]:
books=books[["ISBN","Book-Title","Book-Author",'Year-Of-Publication', 'Publisher']]

In [5]:
books.head(2)

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher
0,0195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press
1,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada

In [6]:
books.rename(columns={"Book-Title":"title","Book-Author":"author","Year-Of-Publication":"year","Publisher":"publisher"},inplace=True)

In [7]:
books.columns

Index(['ISBN', 'title', 'author', 'year', 'publisher'], dtype='object')

In [8]:
users=pd.read_csv("Users.csv")

In [9]:
users.head(2)

   User-ID                   Location   Age
0        1         nyc, new york, usa   NaN
1        2  stockton, california, usa  18.0

In [10]:
users.rename(columns={"User-ID":"user_id","Location":"location","Age":"age"},inplace=True)

In [11]:
users.columns

Index(['user_id', 'location', 'age'], dtype='object')

In [12]:
ratings = pd.read_csv("Ratings.csv")

In [13]:
ratings.head(2)

   User-ID        ISBN  Book-Rating
0   276725  034545104X            0
1   276726  0155061224            5

In [14]:
ratings.rename(columns={"User-ID":"user_id","Book-Rating":"rating"},inplace=True)

In [15]:
ratings.columns

Index(['user_id', 'ISBN', 'rating'], dtype='object')

In [16]:
print(books.shape)
print(users.shape)
print(ratings.shape)

(271360, 5)
(278858, 3)
(1149780, 3)

In [17]:
ratings[ratings["user_id"]==11676].shape

#  user no 11676 rated 13602 books

(13602, 3)

In [18]:
print(ratings["user_id"].value_counts().shape)
#  out of 271360 users only 105283 users rated the books
# other users are only outliersn and garbage for us 

ratings["user_id"].value_counts()
# user rated how many books

(105283,)

11676     13602
198711     7550
153662     6109
98391      5891
35859      5850
          ...
116180        1
116166        1
116154        1
116137        1
276723        1
Name: user_id, Length: 105283, dtype: int64

In [19]:
# user_rated_more_than_200_books=ratings["user_id"].value_counts()>=200
# user_rated_more_than_200_books.shape

In [20]:
x= ratings["user_id"].value_counts()>200  #yeh humko woh true false ki series bna ke de dega..


x[x]  #lekin is method se hum only true extract kar payenge

11676     True
198711    True
153662    True
98391     True
35859     True
          ...
274808    True
28634     True
59727     True
268622    True
188951    True
Name: user_id, Length: 899, dtype: bool

In [21]:
print(x[x].shape)

# 899 peoples are those peoples who rated more than 200 books
# these people helps us to making the book recommandation system :)

(899,)

In [22]:
# now we need the user_id of those peoples who rated more than 200 books
y=x[x]
y.index

Int64Index([ 11676, 198711, 153662,  98391,  35859, 212898, 278418,  76352,
            110973, 235105,
            ...
            260183,  73681,  44296, 155916,   9856, 274808,  28634,  59727,
            268622, 188951],
           dtype='int64', length=899)

In [23]:
ratings["user_id"].isin(y.index)

0          False
1          False
2          False
3          False
4          False
           ...
1149775    False
1149776    False
1149777    False
1149778    False
1149779    False
Name: user_id, Length: 1149780, dtype: bool

In [24]:
ratings[ratings["user_id"].isin(y.index)]

         user_id        ISBN  rating
1456      277427  002542730X      10
1457      277427  0026217457       0
1458      277427  003008685X       8
1459      277427  0030615321       0
1460      277427  0060002050       0
...          ...         ...     ...
1147612   275970  3829021860       0
1147613   275970  4770019572       0
1147614   275970   896086097       0
1147615   275970  9626340762       8
1147616   275970  9626344990       0

[526356 rows x 3 columns]

In [25]:
# so, we need rating dataset of those peoples who rated more than 200 books 
ratings = ratings[ratings["user_id"].isin(y.index)]
ratings.shape

(526356, 3)

In [26]:
books.shape

(271360, 5)

In [37]:

data = {
  "calories": [420, 380, 390,90],
  "duration": [50, 40, 45,89]
}
d1=pd.DataFrame(data)

data1={
    "calories":[420,380,390,420,380,89],
    "fat":[100,200,400,89,9.8,8],
    "weight":[60,50,34,76,8,7],
    "height":[89,90,78,89,9,8]
}

d2= pd.DataFrame(data1)
print(d1)
print(d2)

   calories  duration
0       420        50
1       380        40
2       390        45
3        90        89
   calories    fat  weight  height
0       420  100.0      60      89
1       380  200.0      50      90
2       390  400.0      34      78
3       420   89.0      76      89
4       380    9.8       8       9
5        89    8.0       7       8

In [38]:
d1.merge(d2,on='calories')

   calories  duration    fat  weight  height
0       420        50  100.0      60      89
1       420        50   89.0      76      89
2       380        40  200.0      50      90
3       380        40    9.8       8       9
4       390        45  400.0      34      78

In [32]:
rating_with_books= ratings.merge(books,on="ISBN")

In [34]:
rating_with_books.shape

# before we have 526356 ratings now after merging we have 40,000 less ratings 
# becase due to some reason we doesnt have book dataset of those 40,000 ratings that is why

(487671, 7)

In [51]:
number_rating=rating_with_books.groupby("title")["rating"].count().reset_index().rename(columns={"rating":"no_of_rating"})

In [52]:
number_rating

                                                    title  no_of_rating
0        A Light in the Storm: The Civil War Diary of ...             2
1                                   Always Have Popsicles             1
2                    Apple Magic (The Collector's series)             1
3        Beyond IBM: Leadership Marketing and Finance ...             1
4        Clifford Visita El Hospital (Clifford El Gran...             1
...                                                   ...           ...
160264  Ã?Ã?ber die Pflicht zum Ungehorsam gegen den...             3
160265                                    Ã?Ã?lpiraten.             1
160266                   Ã?Ã?rger mit Produkt X. Roman.             1
160267                            Ã?Ã?stlich der Berge.             1
160268                                Ã?Ã?thique en toc             1

[160269 rows x 2 columns]

In [53]:
final_rating=rating_with_books.merge(number_rating,on="title")

In [57]:
final_rating.head(2)

,user_id,ISBN,rating,title,author,year,publisher,no_of_rating
0,277427,002542730X,10,Politically Correct Bedtime Stories: Modern Ta...,James Finn Garner,1994,John Wiley &amp; Sons Inc,82
1,3363,002542730X,0,Politically Correct Bedtime Stories: Modern Ta...,James Finn Garner,1994,John Wiley &amp; Sons Inc,82

In [60]:
final_rating=final_rating[final_rating['no_of_rating']>=50]

In [61]:
final_rating

,user_id,ISBN,rating,title,author,year,publisher,no_of_rating
0,277427,002542730X,10,Politically Correct Bedtime Stories: Modern Ta...,James Finn Garner,1994,John Wiley &amp; Sons Inc,82
1,3363,002542730X,0,Politically Correct Bedtime Stories: Modern Ta...,James Finn Garner,1994,John Wiley &amp; Sons Inc,82
2,11676,002542730X,6,Politically Correct Bedtime Stories: Modern Ta...,James Finn Garner,1994,John Wiley &amp; Sons Inc,82
3,12538,002542730X,10,Politically Correct Bedtime Stories: Modern Ta...,James Finn Garner,1994,John Wiley &amp; Sons Inc,82
4,13552,002542730X,0,Politically Correct Bedtime Stories: Modern Ta...,James Finn Garner,1994,John Wiley &amp; Sons Inc,82
...,...,...,...,...,...,...,...,...
236701,255489,0553579983,7,And Then You Die,Iris Johansen,1998,Bantam,50
236702,256407,0553579983,0,And Then You Die,Iris Johansen,1998,Bantam,50
236703,257204,0553579983,0,And Then You Die,Iris Johansen,1998,Bantam,50
236704,261829,0553579983,0,And Then You Die,Iris Johansen,1998,Bantam,50
236705,273979,0553579983,0,And Then You Die,Iris Johansen,1998,Bantam,50

In [62]:
final_rating.shape

# now we have 61853 ratings given by those users who give more than 200 ratings 
# and these users give ratings on those books on which more than 50 ratings we have

(61853, 8)

In [67]:
final_rating[final_rating.duplicated(subset=["user_id","title"])]


# now we can see that our dataframe have some duplicates rows
# so first of all removes these duplicates

,user_id,ISBN,rating,title,author,year,publisher,no_of_rating
702,11676,0440977096,10,The Secret Garden,Frances Hodgson Burnett,1989,Laure Leaf,79
710,11676,0879236493,9,The Secret Garden,Frances Hodgson Burnett,1987,David R. Godine Publisher,79
717,35050,0439099390,0,The Secret Garden,Frances Hodgson Burnett,1999,Scholastic,79
721,174791,0439099390,0,The Secret Garden,Frances Hodgson Burnett,1999,Scholastic,79
722,230522,0439099390,0,The Secret Garden,Frances Hodgson Burnett,1999,Scholastic,79
...,...,...,...,...,...,...,...,...
223478,172030,0821744941,9,Dark Angel,Anna Grant,1994,Zebra Books,54
223483,153662,0505524147,0,Dark Angel,Cassandra Collins,2000,Love Spell,54
228875,113270,0743439651,0,Still Waters,Jennifer Lauck,2001,Atria,83
228876,162639,0743439651,0,Still Waters,Jennifer Lauck,2001,Atria,83
228884,185233,074350996X,0,Still Waters,Jennifer Lauck,2001,Simon &amp; Schuster Audio,83

In [70]:
# df = pd.DataFrame({
#     'brand': ['Yum Yum', 'Yum Yum', 'Indomie', 'Indomie', 'Indomie'],
#     'style': ['cup', 'cup', 'cup', 'pack', 'pack'],
#     'rating': [4, 4, 3.5, 15, 5]
# })

# df.duplicated(subset=['brand','style'])

In [71]:
final_rating.drop_duplicates(['user_id','title'],inplace=True)

c:\python39\lib\site-packages\pandas\util\_decorators.py:311: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return func(*args, **kwargs)

In [72]:
final_rating[final_rating.duplicated(subset=["user_id","title"])]
# now we can see that our duplicates are removes from my dataset

Empty DataFrame
Columns: [user_id, ISBN, rating, title, author, year, publisher, no_of_rating]
Index: []

In [73]:
final_rating.shape
# now we have 59850 ratings given by those users who give more than 200 ratings 
# and these users give ratings on those books on which more than 50 ratings we have

(59850, 8)

In [80]:
book_pivot= final_rating.pivot_table(index="title",columns="user_id",values="rating")

In [86]:
book_pivot.shape

# now we have 742 books and 888 columns

(742, 888)

In [87]:
book_pivot

user_id,254,2276,2766,2977,3363,3757,4017,4385,6242,6251,...,274004,274061,274301,274308,274808,275970,277427,277478,277639,278418
title,,,,,,,,,,,,,,,,,,,,,
1984,9.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,0.0,NaN,NaN,NaN,NaN
1st to Die: A Novel,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2nd Chance,NaN,10.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,0.0,NaN,NaN,NaN,NaN,0.0,NaN
4 Blondes,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
84 Charing Cross Road,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,10.0,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
Year of Wonders,NaN,NaN,NaN,7.0,NaN,NaN,NaN,NaN,7.0,NaN,...,NaN,NaN,NaN,NaN,NaN,0.0,NaN,NaN,NaN,NaN
You Belong To Me,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Zen and the Art of Motorcycle Maintenance: An Inquiry into Values,NaN,NaN,NaN,NaN,0.0,NaN,NaN,NaN,NaN,0.0,...,NaN,NaN,NaN,NaN,NaN,0.0,NaN,NaN,NaN,NaN
Zoya,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
"\O\"" Is for Outlaw""",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,8.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [89]:
book_pivot.fillna(0,inplace=True)

In [90]:
from scipy.sparse import csr_matrix
book_sparse = csr_matrix(book_pivot)

In [96]:
from sklearn.neighbors import NearestNeighbors
model=NearestNeighbors(algorithm="brute")

In [98]:
model.fit(book_sparse)

NearestNeighbors(algorithm='brute')

In [121]:
dist,suggestion = model.kneighbors( book_pivot.iloc[237,:].values.reshape(1,-1),n_neighbors=6)

In [120]:
# book_pivot.iloc[237,:].values.reshape(1,-1)

In [154]:
suggestion[0][0]
len(suggestion[0])

6

In [156]:
for i in range(len(suggestion[0])):
    print(book_pivot.index[suggestion[0][i]])

Harry Potter and the Chamber of Secrets (Book 2)
Harry Potter and the Prisoner of Azkaban (Book 3)
Harry Potter and the Goblet of Fire (Book 4)
Harry Potter and the Sorcerer's Stone (Book 1)
Exclusive
The Cradle Will Fall

In [129]:
book_pivot.index[237]

'Harry Potter and the Chamber of Secrets (Book 2)'

In [140]:
np.where(book_pivot.index=="Harry Potter and the Chamber of Secrets (Book 2)")

(array([237], dtype=int64),)

In [169]:
def recommend_books(book_name):
    index= np.where(book_pivot.index==book_name)
    dist,suggestion = model.kneighbors( book_pivot.iloc[237,:].values.reshape(1,-1),n_neighbors=6)
    
    for i in range(len(suggestion[0])):
        if  i==0:
            print("The Suggestion for" ,book_pivot.index[suggestion[0][i]],"are:")
        else:
            print(i,".",book_pivot.index[suggestion[0][i]])

In [170]:
recommend_books(237)

The Suggestion for Harry Potter and the Chamber of Secrets (Book 2) are:
1 . Harry Potter and the Prisoner of Azkaban (Book 3)
2 . Harry Potter and the Goblet of Fire (Book 4)
3 . Harry Potter and the Sorcerer's Stone (Book 1)
4 . Exclusive
5 . The Cradle Will Fall